# Homework 4

Написать программу, работающую подобно команде more, которая осуществляет вывод файла на экран порциями по нажатию клавиши <пробел> (можете выбрать любую).
Нажатие <q>  - прервать работу (дальше не выводить файл).
more [-s] [-num]  [+linenum]  файл
Опции:
-s – предписывает заменять последовательность пустых строк одной пустой строкой.
-num   - целое число задает количество выводимых за один раз строк.
Длина одной порции по умолчанию, т.е. в том случае, если эта опция не задана, 10 строк.
+linenum  -  начать вывод со строки с номером linenum (целое число >=1)
Порядок опций определен, любая из них (в том числе и все) при запуске программы может отсутствовать.

Примеры вызова: 
> ./my_more -s -6 +10 file    
> ./my_more -16 file       
> ./my_more file

Пример перевода терминала в неканонический режим, чтобы нажатие клавиши передавалось в программу сразу без ввода '\n'. Использовать необязательно, но можно при желании.
```
#include <stdio.h>
#include <termios.h>
#include <unistd.h>

int main(int argc, char** argv) {
    static struct termios oldt, newt;
    tcgetattr(STDIN_FILENO, &oldt); //сохранение текущего режима
    newt = oldt;
    newt.c_lflag &= ~(ICANON);
    tcsetattr(STDIN_FILENO, TCSANOW, &newt); // изменение
    
char c;
while (c != 'q') {
        c = getchar();
        printf("==%c\n", c);
        }

  tcsetattr(STDIN_FILENO, TCSANOW, &oldt); // восстановление исходного режима
    return 0;
}
```